app/Http/Controllers/BBSController.php

select * from `boards` order by `id` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 70)
select count(*) as aggregate from `boards`
---
    public function index(Request $request) {
    	$page = $request->get('page');
	   // $msgs = DB::table('boards')->orderBy('id', 'desc')->paginate(10);
    	//$msgs = Board::orderBy('id', 'desc')->paginate(10);
    	$msgs = Board::orderBy('id', 'desc')->with('user')->paginate(10); // avoid N+1 problem

update `boards` set `hits` = 1, `updated_at` = '2018-11-28 06:54:55' where `id` = 677
---
    public function show(Request $request, $id) {

		//$id = $request->get('id');
		$page = $request->get('page');

		$msg = Board::find($id);
		$msg->hits = $msg->hits + 1;
		$msg->save();

update `attachments` set `board_id` = 681, `updated_at` = '2018-11-28 10:00:24' where `id` = 52
delete from `attachments` where `id` = 43
delete from `attachments` where `id` = 50
---
    public function update(Request $request) {
	    $id = $request->get('id');
	    $title = $request->get('title');
	   // $writer = $request->get('writer');
	    $content = $request->get('content');

	    $page = $request->get('page');

		$this->validate($request, ['title'=> 'required',
						/*'writer'=>'required',*/ 'content'=>'required']);
    	$msg = Board::find($id);
    	$msg->update(['title'=>$title, /*'writer'=>$writer,*/ 'content'=>$content]);

 	    if($request->has('attachments')) {
		    foreach($request->attachments as $aid) {
		    	$attach = Attachment::find($aid);
		    	$attach->board()->associate($msg);
		    	$attach->save();
		    }
		}

		if($request->has('del_attachments')) {
			foreach($request->del_attachments as $did) {
				$attach = Attachment::find($did);
				$attach->deleteAttachedFile($attach->filename);
				$attach->delete();

insert into `boards` (`title`, `user_id`, `content`, `updated_at`, `created_at`) values ('fdas', 1, 'fasd', '2018-11-28 09:56:38', '2018-11-28 09:56:38')
update `attachments` set `board_id` = 680, `updated_at` = '2018-11-28 09:56:38' where `id` = 47
---
    public function store(Request $request) {
	    $title = $request->get('title');
	   // $writer = $request->get('writer');
	    $content = $request->get('content');

	    $page = $request->get('page');

		$this->validate($request, ['title'=> 'required',
						/* 'writer'=>'required',*/ 'content'=>'required']);

	    $board = new Board();
	    $board->title = $title;
	    $board->user_id = Auth::user()->id;
	    //$board->writer = $writer;
	    $board->content = $content;
	    $board->save();
	    \Log::debug('BBSController store', ['attachments'=>$request->attachments]);
	    if($request->has('attachments')) {
		    foreach($request->attachments as $aid) {
		    	$attach = Attachment::find($aid);
		    	$attach->board()->associate($board);
		    	$attach->save();

delete from `boards` where `id` = 678
---
    public function destroy(Request $request, $id) {
		//$this->validate($request,['id'=>'required']);
    	\Log::debug('destory', ['id'=>$id]);
		//$id = $request->get("id");
		$page = $request->get("page");

		$msg = Board::find($id);
		$msg->delete();