app/Http/Controllers/BBSController.php

    public function store(Request $request) {
	    $title = $request->get('title');
	   // $writer = $request->get('writer');
	    $content = $request->get('content');

	    $page = $request->get('page');

		$this->validate($request, ['title'=> 'required',
						/* 'writer'=>'required',*/ 'content'=>'required']);

	    $board = new Board();
	    $board->title = $title;
	    $board->user_id = Auth::user()->id;
	    //$board->writer = $writer;
	    $board->content = $content;
	    $board->save();
---
insert into `boards` (`title`, `user_id`, `content`, `updated_at`, `created_at`) values ('DropZone', 1, '파일 첨부가 가능한 게시글 쓰기', '2018-11-28 00:55:33', '2018-11-28 00:55:33')

    public function destroy(Request $request, $id) {
		$this->validate($request,['id'=>'required']);

		//$id = $request->get("id");
		$page = $request->get("page");

		$msg = Board::find($id);
		$msg->delete();
---
delete from `boards` where `id` = 668