app/Http/Controllers/SessionsController.php

select * from `users` where `email` = 'scpark@yju.ac.kr' and `confirm_code` is not null limit 1
---
    public function store(Request $request) {
    	$this->validate($request, [
    		'email' => 'required|email',
    		'password' => 'required|min:6',
    	]);

        $user = User::whereEmail($request->email)->whereNotNull('confirm_code')->first();